/**
 * Copyright (c) 2020 ZxyKira
 * All rights reserved.
 *
 * SPDX-License-Identifier: MIT
 */
#ifndef HAL_4DC8702A_119D_4444_AC76_BE736044C70E
#define HAL_4DC8702A_119D_4444_AC76_BE736044C70E

/* ****************************************************************************************
 * Include
 */

//-----------------------------------------------------------------------------------------
#include "lang/package-info.h"
//-----------------------------------------------------------------------------------------

/* ****************************************************************************************
 * Namespace
 */
namespace hal::usart {
  struct EventReceiver;
}  // namespace hal::usart

/* ****************************************************************************************
 * Class/Interface/Struct/Enum
 */
struct hal::usart::EventReceiver {
  /* **************************************************************************************
   * Method
   */

  /**
   * @brief
   * 接收事件，當成功接收字元時呼叫該方法。
   *
   * @param data 接收資料
   * @return true 持續接收下一個資料
   * @return false 取消接收下一個資料，並關閉接收緩衝器滿的事件監聽。
   */
  virtual bool onUartReceiver(const uint8_t data) abstract;
};

/* ****************************************************************************************
 * End of file
 */

#endif /* HAL_4DC8702A_119D_4444_AC76_BE736044C70E */
